Revit 2027 API
EdgeEndPoint.Index Property
 The index of the start or the end point of an Edge: 0 is the start point, 1 is the end point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
public:
property int Index {
	int get ();
}
member Index : int with get
Property Value
Int32
See Also
Reference
EdgeEndPoint Class
Autodesk.Revit.DB Namespace